-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Хост: MySQL-8.4
-- Час створення: Лют 27 2026 р., 23:23
-- Версія сервера: 8.4.4
-- Версія PHP: 8.4.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `order_db`
--

-- --------------------------------------------------------

--
-- Структура таблиці `admins`
--

CREATE TABLE `admins` (
  `id` int NOT NULL,
  `login` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп даних таблиці `admins`
--

INSERT INTO `admins` (`id`, `login`, `password`) VALUES
(1, 'webdogs', '$2y$12$2B5eJPI3maNCIQX8elpBA.6/xQcC/62AcFSe4btPNjcNevD2JAQzi');

-- --------------------------------------------------------

--
-- Структура таблиці `orders`
--

CREATE TABLE `orders` (
  `id` int NOT NULL,
  `id_tax` int DEFAULT NULL,
  `latitude` decimal(10,8) NOT NULL,
  `longitude` decimal(11,8) NOT NULL,
  `subtotal` decimal(10,2) NOT NULL,
  `tax_amount` decimal(10,2) NOT NULL,
  `total_amount` decimal(10,2) NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблиці `order_taxes`
--

CREATE TABLE `order_taxes` (
  `id` int NOT NULL,
  `composite_tax_rate` decimal(8,5) NOT NULL,
  `state_rate` decimal(8,5) NOT NULL,
  `county_rate` decimal(8,5) NOT NULL,
  `city_rate` decimal(8,5) NOT NULL,
  `special_rates` decimal(8,5) NOT NULL,
  `jurisdictions` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп даних таблиці `order_taxes`
--

INSERT INTO `order_taxes` (`id`, `composite_tax_rate`, `state_rate`, `county_rate`, `city_rate`, `special_rates`, `jurisdictions`, `created_at`) VALUES
(1, 0.08875, 0.04000, 0.00000, 0.04500, 0.00375, 'New York City', '2026-02-25 22:48:36'),
(2, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Albany', '2026-02-25 22:48:36'),
(3, 0.08500, 0.04000, 0.04500, 0.00000, 0.00000, 'Allegany', '2026-02-25 22:48:36'),
(4, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Broome', '2026-02-25 22:48:36'),
(5, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Cattaraugus', '2026-02-25 22:48:36'),
(6, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Cayuga', '2026-02-25 22:48:36'),
(7, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Chautauqua', '2026-02-25 22:48:36'),
(8, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Chemung', '2026-02-25 22:48:36'),
(9, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Chenango', '2026-02-25 22:48:36'),
(10, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Clinton', '2026-02-25 22:48:36'),
(11, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Columbia', '2026-02-25 22:48:36'),
(12, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Cortland', '2026-02-25 22:48:36'),
(13, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Delaware', '2026-02-25 22:48:36'),
(14, 0.08125, 0.04000, 0.03750, 0.00000, 0.00375, 'Dutchess', '2026-02-25 22:48:36'),
(15, 0.08750, 0.04000, 0.04750, 0.00000, 0.00000, 'Erie', '2026-02-25 22:48:36'),
(16, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Essex', '2026-02-25 22:48:36'),
(17, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Franklin', '2026-02-25 22:48:36'),
(18, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Fulton', '2026-02-25 22:48:36'),
(19, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Genesee', '2026-02-25 22:48:36'),
(20, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Greene', '2026-02-25 22:48:36'),
(21, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Hamilton', '2026-02-25 22:48:36'),
(22, 0.08250, 0.04000, 0.04250, 0.00000, 0.00000, 'Herkimer', '2026-02-25 22:48:36'),
(23, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Jefferson', '2026-02-25 22:48:36'),
(24, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Lewis', '2026-02-25 22:48:36'),
(25, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Livingston', '2026-02-25 22:48:36'),
(26, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Madison', '2026-02-25 22:48:36'),
(27, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Monroe', '2026-02-25 22:48:36'),
(28, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Montgomery', '2026-02-25 22:48:36'),
(29, 0.08625, 0.04000, 0.04250, 0.00000, 0.00375, 'Nassau', '2026-02-25 22:48:36'),
(30, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Niagara', '2026-02-25 22:48:36'),
(31, 0.08750, 0.04000, 0.04750, 0.00000, 0.00000, 'Oneida', '2026-02-25 22:48:36'),
(32, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Onondaga', '2026-02-25 22:48:36'),
(33, 0.07500, 0.04000, 0.03500, 0.00000, 0.00000, 'Ontario', '2026-02-25 22:48:36'),
(34, 0.08125, 0.04000, 0.03750, 0.00000, 0.00375, 'Orange', '2026-02-25 22:48:36'),
(35, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Orleans', '2026-02-25 22:48:36'),
(36, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Oswego', '2026-02-25 22:48:36'),
(37, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Otsego', '2026-02-25 22:48:36'),
(38, 0.08375, 0.04000, 0.04000, 0.00000, 0.00375, 'Putnam', '2026-02-25 22:48:36'),
(39, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Rensselaer', '2026-02-25 22:48:36'),
(40, 0.08375, 0.04000, 0.04000, 0.00000, 0.00375, 'Rockland', '2026-02-25 22:48:36'),
(41, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'St. Lawrence', '2026-02-25 22:48:36'),
(42, 0.07000, 0.04000, 0.03000, 0.00000, 0.00000, 'Saratoga', '2026-02-25 22:48:36'),
(43, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Schenectady', '2026-02-25 22:48:36'),
(44, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Schoharie', '2026-02-25 22:48:36'),
(45, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Schuyler', '2026-02-25 22:48:36'),
(46, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Seneca', '2026-02-25 22:48:36'),
(47, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Steuben', '2026-02-25 22:48:36'),
(48, 0.08750, 0.04000, 0.04375, 0.00000, 0.00375, 'Suffolk', '2026-02-25 22:48:36'),
(49, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Sullivan', '2026-02-25 22:48:36'),
(50, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Tioga', '2026-02-25 22:48:36'),
(51, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Tompkins', '2026-02-25 22:48:36'),
(52, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Ulster', '2026-02-25 22:48:36'),
(53, 0.07000, 0.04000, 0.03000, 0.00000, 0.00000, 'Warren', '2026-02-25 22:48:36'),
(54, 0.07000, 0.04000, 0.03000, 0.00000, 0.00000, 'Washington', '2026-02-25 22:48:36'),
(55, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Wayne', '2026-02-25 22:48:36'),
(56, 0.08375, 0.04000, 0.04000, 0.00000, 0.00375, 'Westchester', '2026-02-25 22:48:36'),
(57, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Wyoming', '2026-02-25 22:48:36'),
(58, 0.08000, 0.04000, 0.04000, 0.00000, 0.00000, 'Yates', '2026-02-25 22:48:36');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `order_taxes`
--
ALTER TABLE `order_taxes`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблиці `order_taxes`
--
ALTER TABLE `order_taxes`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
